In [2]:
import os
os.getcwd()

'C:\\Users\\Administrator\\Desktop\\Python Assignments'

In [3]:
import pandas as pd
import numpy as np
import math as m

In [4]:
os.chdir("C:\\Users\\Administrator\\Desktop\\Python Assignments\\DataSets")

In [5]:
oj= pd.read_csv("oj.csv",sep=',',header=0)

In [ ]:
#1.	Find the dimensions of the oj data set
oj.shape

In [ ]:
#2.	Find the structure of the data set
oj.info()

In [ ]:
#3.	Find out the column names in the data set
oj.columns.values

In [ ]:
#4.	Describe the data set
oj.describe()

In [ ]:
#1.	Fetch the first row 3rd column from the data set
print(oj.iloc[0,[2]])

In [ ]:
#2.	Fetch the first, second and Third columns of the oj data frame
print(oj.iloc[:,[0,1,2]])

In [ ]:
#3.	Fetch the first, second, eighth and the 456th rows of the 1st, third and the sixth columns of the data frame
print(oj.iloc[[0,1,7,455],[0,2,5]])

In [ ]:
#4.	Fetch the top 5 rows of the brand column
print(oj.iloc[0:5],['brand'])

In [ ]:
#5.	Fetch top 5 rows of the brand, week and feat details
print(oj.ix[0:5,['brand','week','feat']])

In [ ]:
#6.	Fetch the details of all distinct stores
group=(oj.groupby('store'))
print(group.store.describe())

In [ ]:
#7.	Fetch all the observations for Tropicana brand
oj[oj.brand=='tropicana']

In [ ]:
#8.	Fetch all the observations for Tropicana brand using query function
oj.query("(brand=='tropicana')")

In [ ]:
#9.	Fetch bottom 5 observations for those who have bought Tropicana or dominics.
oj[(oj.brand==('tropicana')) | (oj.brand== ('dominicks'))].tail()

In [ ]:
#10.	Fetch the income, brand, price observations with Tropicana brand without feature advertisement
oj.query("(brand=='tropicana') & (feat==0)")[['INCOME','brand','price']]

In [ ]:
#11.	Add a new column in the dataset: logInc which is the logarithm of the income
#oj['logInc'] = list(map(lambda x:m.log(x),oj.INCOME))
oj['logInc'] =np.log(oj.INCOME)
oj

In [ ]:
#12.	Sort the Data in the increasing order of the week
print(oj.sort_values(by='week'))

##### 12.	Sort the Data in the increasing order of the week
oj.sort_values(1)

In [ ]:
#13.	Sort the data in the decreasing order of Income
print(oj.sort_values(by='INCOME',ascending="F"))

In [ ]:
#14.	Find the mean of the juice price for each brand
oj.groupby('brand')['price'].mean()

In [ ]:
#15.	Find the average income for each brand and at each store
oj.groupby('brand')['INCOME'].mean()

In [7]:
#16(a).	Mean and std deviation of the income
oj.mean()["INCOME"]

10.616734638000503

In [8]:
#16(a).*std deviation of the income
oj.std()["INCOME"]

0.28231362150251377

In [9]:
#16(b).	For income greater than or equal to 10.5, find the mean income
oj[oj.INCOME>=10.5].mean()["INCOME"]

10.759452382031103

In [12]:
#16(c).	For each brand having price >=2.5 find the mean, median, sd of the log of income
oj[oj.price>=2.5].groupby('brand')['INCOME'].agg(['mean','median','std'])

                  mean     median       std
brand
dominicks    10.473626  10.367190  0.410146
minute.maid  10.601137  10.632364  0.300719
tropicana    10.615601  10.635326  0.282522

In [6]:
#17.	Find the Cross tabulation of brands and feature advertisement
pd.crosstab(oj.brand,oj.feat)

feat            0     1
brand
dominicks    7169  2480
minute.maid  6865  2784
tropicana    8045  1604

In [7]:
oj.groupby(["brand","feat"]).agg({"store":np.size})

                  store
brand       feat
dominicks   0      7169
            1      2480
minute.maid 0      6865
            1      2784
tropicana   0      8045
            1      1604

In [10]:
oj.groupby(["feat"]).agg({"brand":np.size})

      brand
feat
0     22079
1      6868

In [11]:
str="Hello"
print(str[:2])

He

In [13]:
list1=[1,3,2]
list1*2

[1, 3, 2, 1, 3, 2]

In [8]:
oj.agg({"store":np.size})

       store
0          1
1          1
2          1
3          1
4          1
5          1
6          1
7          1
8          1
9          1
10         1
11         1
12         1
13         1
14         1
15         1
16         1
17         1
18         1
19         1
20         1
21         1
22         1
23         1
24         1
25         1
26         1
27         1
28         1
29         1
...      ...
28917      1
28918      1
28919      1
28920      1
28921      1
28922      1
28923      1
28924      1
28925      1
28926      1
28927      1
28928      1
28929      1
28930      1
28931      1
28932      1
28933      1
28934      1
28935      1
28936      1
28937      1
28938      1
28939      1
28940      1
28941      1
28942      1
28943      1
28944      1
28945      1
28946      1

[28947 rows x 1 columns]

In [9]:
oj.groupby(["brand"]).agg({"feat":np.size})

             feat
brand
dominicks    9649
minute.maid  9649
tropicana    9649